# Написати калькулятор для консолі, який приймає на вхід 3 числа
# код операції та два числа, до яких ця операція застосовується

# Ви маєте дописати частину з опрацювання вхідних параметрів згідно висвітленої логіки,
# починаючи від 21 рядка, закінчуючи 47.

class Calculator

  # Алгоритм

  # Програма має бути циклом зчитування-опрацювання-вивід результату.
  # він реалізується у блоці коду під назвою console_calculator.
  # Програма має закінчувати роботу при зчитування символу "q"
  # 
  # Приклад вводу " 1 4 6.5"
  # Програма зчитує рядок, опрацьовує значення код операції,
  # приводить два числа до чисельного типу та виводить результат - "10.5"
  # 
  # І знову очікує вводу від користувача

  def calculation arr

 possible_operations = ["1", "2", "3", "4", "5"]

    # Формуємо повідомлення для виводу користувачу
    message = "Доброго дня, вас вітає програма калькулятор!\n"
    message += "Для початку роботи введіть код операції:\n"
    message += "1. +\n"
    message += "2. -\n"
    message += "3. *\n"
    message += "4. /\n"
    message += "5. %\n"

    # Виводимо сформоване повідомлення
    puts message

    # Зчитуємо введений користувачем рядок
    operation = gets.chomp
    # Розбиваємо на набір чисел, де в роді розділювача виступає пробіл
    operation = operation.split(" ")

    # Перевіряємо, чи введений код операції попадає в набір можливих
    if (!possible_operations.include? operation[0])
      # Якщо ні, то виводимо дане повідомлення
      puts "Введений код не існуючої операції"
    else
      # Якщо так, тоді ми записуємо два числа, з якими ми будемо робити операцію у відповідні змінні
      a, b = operation[1].to_f, operation[2].to_f

      # В залежності від обраної операції згідно з повідомленням ми виводимо результат
 puts case operation[0].to_i
      when 1
       puts a+b
      when 2
       puts a-b
      when 3
        puts a*b
      when 4
     puts a/b
      when 5
        puts a%b
      end
      
    end
    # Тут ми нагадуємо користувачеві про можливі обчислювальні похибки
    puts "Дякуємо за користування програмою. Пам'ятайте про похибку обчислень!"


  # Тут нічого змінювати не потрібно !
  def console_calculator

      puts "Для обчислення бінарних операцій слід записути через пробіл \n код операції та два операнди"
      puts "Коди операцій 1: +, 2: -, 3: *, 4: /"
      puts "Для виходу з програми введіть символ 'q'"

      while 1 == 1
        input = gets.chomp
        arr = input.split(" ")

        result = calculation arr

        break unless result

        puts result
      end

  end
end